In [45]:
# prompt: read csv

import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/Likhitha02-tech/PDS/refs/heads/main/data_set/train.csv')
print(df.shape)

(5847, 14)


a)  Look for the missing values in all the columns and either impute them (replace with mean, median, or mode) or drop them. Justify your action for this task.     (4 points)

In [46]:
# Drop the 'New_Price' column due to a large number of missing values.
df = df.drop('New_Price', axis=1)

# Iterate through the remaining columns and impute or drop missing values.
for col in df.columns:
    if df[col].isnull().any():
        if df[col].dtype == 'object':  # Categorical columns
            df[col] = df[col].fillna(df[col].mode()[0]) # Impute with mode for categorical
        else:  # Numerical columns
            df[col] = df[col].fillna(df[col].mean())  # Impute with mean for numerical

print(df.head())
df.to_csv('clean_train.csv', index=False)

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type     Mileage   Engine  \
0              41000    Diesel       Manual      First  19.67 kmpl  1582 CC
1              46000    Petrol       Manual      First    13 km/kg  1199 CC
2              87000    Diesel       Manual      First  20.77 kmpl  1248 CC
3              40670    Diesel    Automatic     Second   15.2 kmpl  1968 CC
4              86999    Diesel       Manual      First  23.08 kmpl  1461 CC

       Power  Seats  Price
0  126.2 bhp    5.0  12.50
1   88.7 bhp    5.0   4.50
2  88.76 bhp    7.0   6.00
3  140.8 bhp    5.0  17.74
4   63.1 bhp    5.0   3.50

b) Remove the units from some of the attributes and only keep the numerical values (for example remove kmpl from “Mileage”, CC from “Engine”, bhp from “Power”, and lakh from “New_price”). (4 points)

In [47]:
# Remove units from specified columns
for col in ['Mileage', 'Engine', 'Power']:
    df[col] = df[col].astype(str).str.extract('(\d+\.?\d*)').astype(float)
df.to_csv('removingUnit_train.csv', index=False)

In [48]:
print(df.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0              41000    Diesel       Manual      First    19.67  1582.0
1              46000    Petrol       Manual      First    13.00  1199.0
2              87000    Diesel       Manual      First    20.77  1248.0
3              40670    Diesel    Automatic     Second    15.20  1968.0
4              86999    Diesel       Manual      First    23.08  1461.0

    Power  Seats  Price
0  126.20    5.0  12.50
1   88.70    5.0   4.50
2   88.76    7.0   6.00
3  140.80    5.0  17.74
4   63.10    5.0   3.50

C) Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot encoded value.  (4 points).

In [49]:
# Perform one-hot encoding on 'Fuel_Type' and 'Transmission'
df = pd.get_dummies(df, columns=['Fuel_Type', 'Transmission'], drop_first=True)

# Display the first few rows of the modified DataFrame
print(df.head())

# Save the updated DataFrame to a new CSV file
df.to_csv('onehot_encoded_train.csv', index=False)

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  Price  \
0              41000      First    19.67  1582.0  126.20    5.0  12.50
1              46000      First    13.00  1199.0   88.70    5.0   4.50
2              87000      First    20.77  1248.0   88.76    7.0   6.00
3              40670     Second    15.20  1968.0  140.80    5.0  17.74
4              86999      First    23.08  1461.0   63.10    5.0   3.50

   Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual
0               False             False                 True
1               False              True                 True
2               False             False                 True
3               False             False                False
4               False             False                 True

In [50]:
# Calculate the current age of the car
current_year = 2024  # Replace with the current year
df['Car_Age'] = current_year - df['Year']

# Display the first few rows of the DataFrame with the new feature
print(df.head())

# Save the updated DataFrame to a new CSV file
df.to_csv('Car_Age_train.csv', index=False)

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  Price  \
0              41000      First    19.67  1582.0  126.20    5.0  12.50
1              46000      First    13.00  1199.0   88.70    5.0   4.50
2              87000      First    20.77  1248.0   88.76    7.0   6.00
3              40670     Second    15.20  1968.0  140.80    5.0  17.74
4              86999      First    23.08  1461.0   63.10    5.0   3.50

   Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual  Car_Age
0               False             False                 True        9
1               False              True                 True       13
2               False             False                 True       12
3               False             False                False       11
4               False             False                 True       11

e) Perform select, filter, rename, mutate, arrange and summarize with group by operations (or their equivalent operations in python) on this dataset. (4 points)

In [51]:
# Select specific columns
selected_df = df[['Name', 'Location', 'Year', 'Kilometers_Driven', 'Fuel_Type_Petrol', 'Transmission_Manual', 'Price']]

# Filter rows based on a condition
filtered_df = selected_df[(selected_df['Year'] > 2015) & (selected_df['Kilometers_Driven'] < 100000)]

# Rename columns
renamed_df = filtered_df.rename(columns={'Name': 'Car_Name', 'Kilometers_Driven': 'Mileage'})

# Mutate (add a new column)
renamed_df['Price_in_lakhs'] = renamed_df['Price'] / 100000  # Assuming Price is in rupees

# Arrange (sort)
arranged_df = renamed_df.sort_values(by=['Year', 'Price'], ascending=[False, True])

# Summarize with group by
summary_df = arranged_df.groupby('Location')['Price_in_lakhs'].agg(['mean', 'median', 'count'])

# Display and save the results
print(summary_df)
summary_df.to_csv('summary_train.csv')

                mean    median  count
Location
Ahmedabad   0.000116  0.000080     49
Bangalore   0.000191  0.000115     53
Chennai     0.000130  0.000073     93
Coimbatore  0.000184  0.000104    361
Delhi       0.000148  0.000080    102
Hyderabad   0.000134  0.000084    144
Jaipur      0.000082  0.000063     92
Kochi       0.000130  0.000079    363
Kolkata     0.000073  0.000050     95
Mumbai      0.000133  0.000082    208
Pune        0.000101  0.000070    116